## 기초통계요약

In [1]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

```
1. 데이터 관측치 개수?, 행 수?, 데이터 수? row 수? 891
2. 컬럼 개수? 피처 수? 변수 개수? 특성 수? 15
3. 각 컬럼의 데이터 타입? 적절
4. 결측치 유무 확인.age, embarked, deck, embark_town
```

In [12]:
len(df)   # 관측치 개수 891 
len(df.columns)   # 행 수 15
df.index
df.values

array([[0, 3, 'male', ..., 'Southampton', 'no', False],
       [1, 1, 'female', ..., 'Cherbourg', 'yes', False],
       [1, 3, 'female', ..., 'Southampton', 'yes', True],
       ...,
       [0, 3, 'female', ..., 'Southampton', 'no', False],
       [1, 1, 'male', ..., 'Cherbourg', 'yes', True],
       [0, 3, 'male', ..., 'Queenstown', 'no', True]], dtype=object)

In [16]:

len(df) #row, 관측치 개수

df.size #데이터 value 수

df.shape #행,열 개수

df.ndim  #차원 수

2

In [17]:
# 기초 통계 정도
# 수치형 피처에 대해서만 나옴
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [18]:
df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [19]:
# 수준확인, 클래스 확인
# 데이터가 10만개가 있으면 다 볼 수 가 없잖아
# 그래서 value_counts() 쓰면 해당 피처가 어떻게 구분되어 있고 각 몇 개인지 나옴.
df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [21]:
# 수준확인, 클래스 확인, 유일한 값
df['pclass'].value_counts()

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [22]:
# 수준확인, 클래스 확인
df['alone'].value_counts()

alone
True     537
False    354
Name: count, dtype: int64

In [23]:
# 수준 개수, 클래스 개수 -> pclass가 3개로 나눠져 있으니까 3이 나옴
df['pclass'].nunique()

3

In [24]:
# 수준 개수, 클래스 개수
df['alone'].nunique()

2

In [26]:
df['pclass'].unique()

array([3, 1, 2], dtype=int64)

In [28]:
df['survived'].unique()

array([0, 1], dtype=int64)

In [27]:
#해당 피처의 합계
df['survived'].sum()

342

In [29]:
#해당 피처의 평균값
df['age'].mean()

29.69911764705882

In [30]:
#해당 피처의 중간값
df['age'].median()   # 중요함 다 외우는 게 편함ㅋ

28.0

In [32]:
#해당 피처의 사분위수
df['age'].quantile([0.25,0.75])

0.25    20.125
0.75    38.000
Name: age, dtype: float64

In [33]:
#해당 피처의 최소, 최대값
df['age'].min(),df['age'].max()

(0.42, 80.0)

In [34]:
#해당 피처의 분산, 표준편차
df['age'].var(),df['age'].std()

(211.01912474630802, 14.526497332334042)